[{"id":1,"creator":"Alexandru Lazar","publishDate":"18 Nov 2023","title":"Ten Habits that will get you ahead of 99% of People","subtitle":"Improve your life and get ahead of your peers in 10 simple steps","image":"https://miro.medium.com/v2/resize:fit:828/format:webp/0*mXL20vzpbmtpdqYW","sections":[{"content":[{"text":"The concept of habits became extremely popular in the recent years, mostly due to the personal development wave brought up by the Gen Z culture."},{"text":"Also, due to the books that appeared in the recent years, out of which, the most famous and a favorite of mine, Atomic Habits."},{"text":"Mostly, all this movement is about is taking control of your life. People were living on autopilot for so long, adhering to standards imposed by society, doing what needed to be done, without keeping track on how they spend their time."},{"text":"As mental health became something people took seriously, it was inevitable that we would go to the cause of these issues and analyze what we do with our lives, and that is tracking habits."}]},{"title":"The unrealistic habits movement","content":[{"text":"The huge talk about habits and attention spent on it, sparked a lot of analysis into high performers, celebrities, CEOs, entrepreneurs, investors and any personality that is even remotely famous or has a following."},{"text":"Out of these podcasts, books and YouTube videos, there appeared a multitude of habits and routines that are not only unsustainable and unrealistic, but they might cause anxiety and strain on the body, which defies the purpose of having them in the first place."},{"text":"So let me tell you something once and for all:"},{"quote":"You don’t have to wake up at 5am, if that doesn’t work for you"},{"text":"You don’t have to do anything. The one thing you have to do is listen to your mind and body, and choose from these habits only what works for you and brings you a certain benefit."}]},{"title":"The 10 habits that improved my life","content":[{"text":"What I planning to give you today is a list of the habits that I have personally picked from the thousands that are popular, implemented, tested and adjusted into my life."},{"text":"The order is completely random. So let’s begin:"}]},{"title":"Have a good sleep hygiene","content":[{"image":"https://miro.medium.com/v2/resize:fit:828/format:webp/0*5BHrOrt59u99vKRl"},{"text":"In my own personal development journey, I was working on multiple aspects of my life: fitness, relationships, nutrition. But I was always leaving sleep as something to tackle on down the road."},{"text":"I was always choosing having fun, partying, watching Netflix, movies, going out, reading, instead of sleeping."},{"text":"While being in a plateau with my gym goals and nutrition, I got a dog. As some of you might know, dogs go to sleep pretty early and don’t tend to sleep in. This forced me to leave parties earlier, prioritize sleep and go to bed earlier because I was woken up pretty early in the morning."},{"text":"They key takeaways here are:","style":"bold"},{"list":[{"text":"Go to bed relatively earlier and wake up earlier (follow the natural circadian rhythm of your body)"},{"text":"Sleep for 8 hours (at least 7, at most 9)"},{"text":"Wake up at the end of a sleep cycle. Sleep cycles usually take 90 minutes. So set your alarm at the end of a multiple of 90 minutes."},{"text":"Keep your bedroom a bit cooler than the rest of your house"},{"text":"Keep your bedroom dark while you sleep"}],"type":"bullet"}]},{"title":"Exercise / Workout every day","content":[{"image":"https://miro.medium.com/v2/resize:fit:828/format:webp/0*QRzpjaNY8L4BPl8S"},{"text":"There are countless studies on the benefits of exercise on your body, both physically and mentally."},{"text":"What I observed with my training was that it gave me a few valuable things:","style":"bold"},{"list":[{"text":"Discipline"},{"text":"Stress and anxiety relief"},{"text":"A purpose/goal"},{"text":"Dopamine"},{"text":"Energy"},{"text":"Motivation"}],"type":"bullet"},{"text":"My training / exercise routine includes 3 or 4 strength training sessions that are no longer than one hour, once a week boxing class / swimming laps and 10.000 steps a day."},{"text":"A great suggestion here based on my trials as a busy individual and studies from other specialists such as Andrew Huberman, it’s best to have these sessions in the morning, before work. This will help keep your energy levels high, avoid the afternoon energy drop, avoid over-caffeinating, keep your motivation high for the day and improve your mood."},{"text":"Whenever you have time to do it, make sure to include it within your habits."}]},{"title":"Don’t drink coffee for the first 1–2 hours after you wake up","content":[{"image":"https://miro.medium.com/v2/resize:fit:1400/format:webp/0*YHUbS7genwNBfKcJ"},{"text":"Coffee is probably your favorite morning ritual, your go to energy source, and I am the same. Giving up coffee is just something I would not do ever."},{"text":"However, over-caffeinating is a real thing and a detrimental one at that. To avoid needing another coffee at lunchtime or in the afternoon, drink your first one 1–2 hours after you wake up."},{"text":"As Atomic Habits describes amazingly, each habit has a cue. Usually, waking up is our signal to go get coffee. To add or remove habits, you need to play around with the cues."},{"text":"For example, I am using the waking up cue, to get dressed and go to the gym. After that, I come home and get ready for work. At 9:00 when I turn on my laptop, that’s my cue to drink my coffee. Usually I wake up at 7:00–7:30 so I have between 1 and 2 hours before my coffee."}]}]},{"readEstimate":5,"creator":"Gebo Srant","publishDate":"2024-02-14","title":"7 Things emotionally intelligent people DON’T say","subtitle":"","image":"https://miro.medium.com/v2/resize:fit:828/format:webp/1*zyC7tYT2GyTyLFq7M8h0BA.jpeg","sections":[{"title":"","content":[{"image":"https://miro.medium.com/v2/resize:fit:828/format:webp/1*zyC7tYT2GyTyLFq7M8h0BA.jpeg"},{"text":"Emotional Intelligence is one of the most important power skills that every professional needs."},{"text":"Emotionally intelligent people are aware of their strengths and weaknesses, open to feedback and collaboration, and capable of building rapport (= establishing a connection) with others."},{"text":"What they DON’T do is use the following 7 phrases."}]},{"title":"","content":[{"text":"1. You always / you never"},{"text":"For example: “You always message me after work hours” or “You’re never happy with my work no matter what I do”."},{"text":"What’s wrong with this phrase? Emotionally intelligent people don’t point fingers when they point out issues. They focus on solving the problem and inspiring people to improve rather than launching personal attacks."},{"text":"Instead, you could say:"},{"quote":"“I feel like my work is not meeting your expectations. Can you tell me what you’d like me to change so that we’re on the same wavelength?”"}]},{"title":"","content":[{"text":"2. Why are you so…?"},{"text":"For example: “Why are you so uncooperative?”"},{"text":"This question provokes an even more negative response instead of de-escalating the issue."},{"text":"It sounds like you’re blaming the person for being a certain way. This guarantees to put them on the defensive."},{"text":"Instead, you could say:"},{"quote":"“Help me understand your perspective.” or “Why do you feel this way about my proposal?”"},{"text":"The idea is to get the person to share their perspective free of judgment so you can reach a consensus."}]},{"title":"","content":[{"text":"3. Whatever / Doesn’t matter"},{"text":"These can often sound plain disrespectful. For example:"},{"text":"I can share these files with you if you want."},{"quote":"When used like that, these phrases demonstrate very poor empathy. What’s the alternative? Just don’t use them when you respond to suggestions or offers."},{"text":"Use them only when you want to say that there is no wrong option or something is genuinely not important."},{"text":"For example: It doesn’t really matter when we complete this task because we don’t have a strict deadline for it."}]},{"title":"","content":[{"text":"4. That’s how I’ve always done it before"},{"text":"When you explain why you did something a certain way by saying “That’s just how I’ve always done it before” — this makes you come across as an inflexible person who is not open to learning."},{"text":"Instead, try saying:"},{"quote":"“Do you think there’s a more effective approach to doing this? I’d like to learn about it”"}]},{"title":"","content":[{"text":"5. I don’t have time for this"},{"text":"This phrase sounds very disrespectful. It’s like you’re saying that you’re busier than everyone else and more important than them, and that’s not the kind of attitude you want to have with your colleagues or clients."},{"text":"Instead, say:"},{"quote":"“I can’t fit it into my schedule” or simply “Would you be able to take on this task? I would highly appreciate it”."},{"text":"6. I’ll try"},{"text":"This phrase often shows a lack of commitment and motivation. More often than not it means “I want to end this conversation and NOT do the thing you want me to do”."},{"text":"Remember that it’s ok to disagree or clarify what needs to be done rather than avoiding a task by making vague promises."},{"quote":"For example, if your coworker says:                                                                                                                                                                                                                                                             \"Can you automate this process?\"                                                       "},{"quote":"You can say:                                                                                                                                                                                                                                                             \"I’d love to but I don’t really know how I would go about it. Do you have any ideas by any chance?\""}]},{"title":"","content":[{"text":"7. It’s impossible / This can’t be done / We can’t do that"},{"text":"Emotionally intelligent people are never too quick to shut down ideas or possibilities because they understand the importance of fostering an innovative and forward-thinking work culture."},{"text":"Instead, they are likely to say:"},{"quote":"“How about we push this task to the back burner for now?” or “This will be challenging because our team doesn’t have any prior experience in this area. Can you explain why we would need this? I might be able to dig around and think of a solution.”"},{"text":"It’s important to note that using these phrases doesn’t necessarily mean you lack emotional intelligence. At the end of the day, as long as you can communicate with politeness and empathy, you will continue to develop your potential and grow your emotional intelligence."}]}],"id":891538757910890},{"readEstimate":2,"creator":"Rosen Kamenov","publishDate":"2024-02-14","title":"Hello and welcome to my blogging site","subtitle":"This is the first blog posted from a phone 📱 ","image":"","sections":[{"title":"","content":[{"text":"I love this app is very nice and it has a very nice mobile editor."},{"text":"I need to add more edit options and then the app will become more complete"},{"text":"After that i will add drafts, profiles likes, saves and other profile related stuff"},{"text":"If i had to assume how much off the app is complete i would assume about 50%. I need to make it so that you can add things mid section."}]},{"title":"","content":[{"text":"Because right now that is impossible i also need to add:"},{"quote":"Text styles and editing"},{"text":"But i will do that later. Or maybe now who knows."},{"text":"I just love this project and i hope i have the motivation to finish it and truly make it:"},{"quote":"Something great"}]}],"id":920282792639567},{"readEstimate":1,"creator":"Mishkata Toshko","publishDate":"2024-02-14","title":"Jkdhsis","subtitle":"Isshns sjsva and the rest are just a few years ","image":"","sections":[{"title":"","content":[{"text":"Hazard has a good game in his first year in a row and is still a good defender "},{"quote":"The most common type is a single or single cell or a single chromosome "}]},{"title":"","content":[{"text":"Useful for me is to get the same amount as you do in a week and "},{"text":"Haha abandon it now you know it will happen "},{"image":"https://images.app.goo.gl/UhnE1y9ZL63Fipek6"},{"image":"https://www.google.com/imgres?imgurl=http%3A%2F%2Fmedia.cntraveler.com%2Fphotos%2F5eb18e42fc043ed5d9779733%2Fmaster%2Fpass%2FBlackForest-Germany-GettyImages-147180370.jpg&tbnid=MCZl4Nu6ZvDpjM&vet=1&imgrefurl=https%3A%2F%2Fwww.cntraveler.com%2Fgallery%2Fthe-most-beautiful-forests-in-the-world&docid=W5p0lFHj5EyboM&w=4299&h=2866&itg=1&source=sh%2Fx%2Fim%2Fm4%2F3&kgs=bc7f4e494c0a3184"}]}],"id":793432389351671},{"readEstimate":3,"creator":"Rosen Kamenov","publishDate":"2024-02-15","title":"How to Save 5 Hours a Day in Under 3 Minutes","subtitle":"","image":"https://miro.medium.com/v2/resize:fit:828/format:webp/0*xAxxfevL7B_2Dzow","sections":[{"title":"","content":[{"image":"https://miro.medium.com/v2/resize:fit:828/format:webp/0*xAxxfevL7B_2Dzow"}]},{"title":"","content":[{"text":"I know, I know."},{"text":"Five hours a day?"},{"text":"Sounds like a sci-fi movie, right?"},{"text":"But hear me out."},{"text":"I used to be the queen of the 24-hour hustle, drowning in to-do lists and staring down the barrel of burnout."},{"text":"I juggled a demanding job, a side hustle, and a social life, convinced there weren’t enough hours in the day to get everything done."},{"text":"Then, I stumbled upon the timeless truth: it’s not about doing more, it’s about doing less, but better."},{"text":"Think of it this way: you wouldn’t try to build a house without a blueprint, would you?"},{"text":"Yet, we approach our days with nothing but a vague, ever-growing list of tasks."},{"text":"This is a recipe for overwhelm, stress, and, yes, wasted time."},{"text":"A study by the University of California, Berkeley, found that the average knowledge worker spends 2.6 hours a day on non-core activities, like scrolling through social media or answering irrelevant emails."},{"text":"That’s over 30% of your workday vanishing into thin air!"},{"text":"But here’s the good news: it doesn’t have to be this way."},{"text":"By learning to prioritize ruthlessly and manage your time effectively, you can reclaim those lost hours and transform your day."},{"text":"In 3 minutes (yes, just 3!), I set up a simple system:"},{"text":"Prioritization Matrix: I listed my tasks based on urgency and importance, using a simple Eisenhower Matrix. This helped me identify the “must-dos” from the “nice-to-dos.”"},{"text":"Time Blocking: I blocked out specific time slots for specific tasks, creating a visual map of my day. This prevented me from context-switching and kept me laser-focused."},{"text":"Batching: I grouped similar tasks together, like responding to emails or making phone calls. This eliminated the mental fatigue of constantly switching gears."},{"text":"The results were astonishing."},{"text":"Within a few days, I felt calmer, more productive, and, yes, I had time."},{"text":"Time to read, to exercise, to actually enjoy life."},{"text":"I wasn’t just working harder, I was working smarter."},{"text":"So, Here’s your action plan:"},{"text":"Identify your time thieves: Track your activities for a day and see where your time goes. Be honest!"},{"text":"Prioritize ruthlessly: Ask yourself, “What are the three things that absolutely must get done today?”"},{"text":"Delegate or automate: Can someone else do it? Can technology handle it? Free your time for what matters most."},{"text":"Schedule ruthlessly: Block out time in your calendar for your priorities, just like you would an important meeting."},{"text":"Say no more often: Protect your time fiercely. Learn to decline requests that don’t align with your goals."},{"text":"Five hours a day might sound impossible, but when you focus on doing less, but better, the reality is far more satisfying."},{"text":"Share your time-saving hacks in the comments below! Let’s inspire each other to break free from the busyness trap."}]},{"title":"","content":[{"quote":"If you enjoy reading my work and find it valuable, please consider leaving me a tip to support my writing. Any amount is appreciated, and your tip will help me to continue creating high-quality content."},{"text":"Also,"},{"quote":"If you enjoy reading my work and find it valuable, please consider subscribing to my email list. I send out a weekly newsletter with my latest blog posts, exclusive content, and other updates."}]},{"title":"","content":[]}],"id":246152670290869},{"readEstimate":1,"creator":"Rosen Kamenov","publishDate":"2024-02-15","title":"Testing new feature + features that are about to be added.","subtitle":"This is a blog in which some feature will be tested and you will be informed of new features","image":"https://www.treehugger.com/thmb/nSp8ESJ1N6zq_bsTVL_MoSrKAqA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1273584292-cbcd5f85f4c646d58f7a7fa158dcaaeb.jpg","sections":[{"title":"","content":[{"text":"First we have the new image getter which should make the main page way better:"},{"image":"https://www.treehugger.com/thmb/nSp8ESJ1N6zq_bsTVL_MoSrKAqA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1273584292-cbcd5f85f4c646d58f7a7fa158dcaaeb.jpg"},{"text":"Let's hope this works."},{"text":"Then we have the new algorithm for calculating the read estimate of a blog so that is also pretty neat."},{"text":"So now new feature:"},{"quote":"DISCLAIMER: This is not a complete list and many features are expeted in the future."},{"text":"1. We have lists. You will soon be able to add proper lists. They will have 2 different styles: numbered or bullet points. I am really looking forward to implementing these lists."},{"text":"2. We have new text styles. If you wanted your text to be italic, bold or if you feeling extra - both! This is a feature that will soon be implemented as soon as I fugure out how to do it"},{"text":"3. The like, favourite and share buttons on the blogs will finally get funcionality. The liked and favourited blogs will be stored in your profile. Which bring us to the next feature:"},{"text":"4. Profiles. You can now look at your own or other people's profiles. You can view their blogs, likes and favourites. "},{"text":"That's it..."},{"text":"for now atleast."}]}],"id":470288458166689}]